artillery.yml
config:
  target: 'http://localhost:4444'
  phases:
    - duration: 60
      arrivalCount: 6
    - duration: 60
      arrivalCount: 60
    - duration: 60
      arrivalCount: 600
    - duration: 60
      arrivalCount: 6000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/?id=9576132"
    - get:
        url: "/?id=9142621"
    - get:
        url: "/?id=9867867"
    - get:
        url: "/?id=9998778"
    - get:
        url: "/?id=9095401"
    - get:
        url: "/?id=9136632"
    - get:
        url: "/?id=9825278"